位运算：我是个废物，但我能装逼
排序：我无处不在
二分搜索：我无处不在
前缀和与差分：我也不知道我能干嘛，溜了
双指针：为什么要单独给我起个名啊...
离散化：我用的是真的少
区间合并：我用的是真的少
  
* 位运算，a^b

  所谓位运算, 考虑成数组就好了
    
  a^b = a^b[0]*2^0 * a^b[1]*2^1 + a^b[2]*2^2...

  #+header: :stdin example
  #+BEGIN_SRC go
	package main

	import "fmt"

	func main() {
		a, b, p := 2, 2, 128
		res := 1
		fmt.Scanf("%v %v %v", &a, &b, &p)
		for base,i, b:=a, 0, b;  i < 32; i,base, b=i+1, base*base % p, b>>1 {
			if b & 1 == 1 {
				res = res * base % p
			}		
		}
		fmt.Println(res)
	}
  #+END_SRC

  #+RESULTS:
  : 4

* 位运算，a*b

  基本和上面一样

  #+BEGIN_SRC go
	package main

	import "fmt"

	func main() {
		a, b, p := 2, 5, 6
		res := 0
		for base,i:=a,0; i<32;i, base, b=i+1, base*2 % p, b >>1 {
			if b & 1 == 1{
				res = (res + base) % p
			}
		}
		fmt.Println(res)
	}
  #+END_SRC

  #+RESULTS:
  : 4
* 快速排序

   注意, 这里不能选x:=a[0], 因为除了第一轮, 后面的子区间, 就没有a[0]了

  #+BEGIN_SRC go 
	package main

	import "fmt"

	func main() {
		a := []int{2, 5, 9, 4, 1, 6, 8, 10}
		qsort(a, 0, len(a)-1)
		for _, t := range a {
			fmt.Println(t)
		}
	}

	func qsort(a []int, l, r int) {
		if l >= r {
			return
		}
		x := a[(l+r)>>1]		
		i, j := l, r
		for i < j {
			for a[i] < x {
				i++
			}
			for a[j] > x {
				j--
			}
			if i < j {
				a[i], a[j] = a[j], a[i]
			}	
		}
		qsort(a, l, j)
		qsort(a, j+1, r)
	}
  #+END_SRC

  #+RESULTS:
  : 1
  : 2
  : 4
  : 5
  : 6
  : 8
  : 9
  : 10
* 二分搜索
  
  #+BEGIN_SRC go
	package main

	import "fmt"

	func main() {
		a := []int{1, 3, 5, 7, 8,10, 11}	
		fmt.Println(bsearch(a, 0, len(a)-1, 5))	
	}

	func bsearch(a []int, l, r, target int) int {
		if l >= r {
			return l
		}	
		mid := (l + r) >> 1
		if target <= a[mid] {
			return bsearch(a, l, mid, target)
		} else {
			return bsearch(a, mid+1, r, target)
		}	
	}
  #+END_SRC

  #+RESULTS:
  : 2
* 二分搜索, 搜索左边最大
  
   #+BEGIN_SRC  go
	 package main

	 import "fmt"

	 func main() {
		 a := []int{1, 3, 5, 7, 8, 10, 11}
		 fmt.Println(lb(a, 0, len(a)-1, 5))
	 }

	 func lb(a []int, l, r, target int) int {
		 if l >= r {
			 return l
		 }
		 mid := (l + r +1 ) >> 1
		 if target >= a[mid] {
			 return lb(a, mid, r, target)
		 } else {
			 return lb(a, l, mid-1, target)
		 }	
	 }
   #+END_SRC

   #+RESULTS:
   : 2
* 二分搜索, 搜索右边最小

  #+BEGIN_SRC go
	package main

	import "fmt"

	func main() {
		a := []int{1, 3, 5, 7, 8, 10, 11}
		fmt.Println(ub(a, 0, len(a)-1, 6))
	}

	func ub(a []int, l, r, target int) int {
		if l >= r {
			return l
		}
		mid := (l + r) >> 1
		if target <= a[mid] {
			return ub(a, l, mid, target)		
		} else {
			return ub(a, mid+1, r, target)
		}
	}
  #+END_SRC

  #+RESULTS:
  : 3
* 二分搜索，数的三次方根

  #+BEGIN_SRC go
	package main

	import "fmt"

	func main() {
		var a float64 = 9.0
		fmt.Printf("%.2f", sqrt(a))
	}

	func sqrt(a float64) float64 {
		var l, r float64 = 0, 1e9
		for r-l >= 1e-6 {
			x := (l+r) / 2
			if x*x*x < a {
				l, r = x, r
			} else {
				l, r = l, x
			}
		}
		return l
	}
  #+END_SRC

  #+RESULTS:
  : 2.08
* 双指针，最长不重复子串

  双指针， 又叫快慢指针， 是一种算法技巧， 用来在遍历过程中维护一段满足某种性质的区间，通常形式如下：

  #+BEGIN_EXAMPLE
	for j < n; j++ {
		// find i according to j
		res = max(res, i-j+1) // best [i, j]
	}
  #+END_EXAMPLE

  本题的基本思路就是为每个快指针， 找到左边最长的不重复位置，并用last[]用空间换时间进行优化

  #+BEGIN_SRC go
	package main

	import "fmt"

	func main() {
		s := []byte("asdasdasdasfasfasf")
		fmt.Println(solve(s))
	}

	func solve(s []byte) int {
		res := 0	
		i, j := 0, 0	
		last := make([]int, 256) // 最大不会超过256	
		for i:=0; i < len(last); i++ {
			last[i] = -1
		}	
		for ; j < len(s); j++ {
			c := s[j]
			if last[c] >= i {
				i = last[c]+1
			} // 即为当前快指针找到了对应的慢指针
			last[c] = j
			res = max(res, j-i+1)
		}
		return res
	}

	func max(a, b int) int {
		if a > b {
			return a
		} else {
			return b
		}	
	}
  #+END_SRC

  #+RESULTS:
  : 4
* 双指针，数组元素的目标和  

  分析：两个数组都是升序，为了凑a[i] + b[j] = target, 可以考虑一个从小段出发， 一个从大段出发

  双指针， 指向两个数组

  严格来说，这道题和“双指针”关系不大，只是确实用了两个指针而已

  #+BEGIN_SRC go 
	package main

	import "fmt"

	func main() {
		a := []int{1, 3, 4, 5, 7, 10}
		b := []int{2, 4, 6, 8, 10}
		target := 14
		fmt.Println(solve(a, b, target))	
	}

	func solve(a, b []int, target int) (int, int) {
		i, j := 0, len(b)-1
		for i < len(a) && j >= 0 {
			if a[i] + b[j] == target {
				return i, j
			} else if a[i] + b[j] < target {
				i++
			} else {
				j--
			}
		}
		return 0, 0
	}
  #+END_SRC 

  #+RESULTS:
  : 2 4
  
